{
  "session_id": "c7ee8f43-8740-4a25-9dbc-e6d2fb91c61a",
  "full_text": " The one thing people talk about depression all the time, the difference between depression and sadness, sadness is just, you know, from happenstance, whatever happened or didn't happen for you. And depression is your body saying, fuck you, I don't want to be this character anymore. I don't want to hold up this avatar that you've created in the world, it's too much for me. So a friend of mine who's a spiritual teacher has a really good take, his name is Jeff Foster. His take on it is that they should change, you know, you should think of the word as depressed as deep rest. Deep rest, your body needs to be depressed. It needs deep rest from the character that you've been trying to play.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 9.86,
      "text": "The one thing people talk about depression all the time, the difference between depression and sadness, sadness is just, you know, from happenstance, whatever happened or didn't happen for you.",
      "duration": 9.86
    },
    {
      "start": 10.5,
      "end": 17.26,
      "text": "And depression is your body saying, fuck you, I don't want to be this character anymore.",
      "duration": 6.76
    },
    {
      "start": 17.94,
      "end": 23.88,
      "text": "I don't want to hold up this avatar that you've created in the world, it's too much for me.",
      "duration": 5.94
    },
    {
      "start": 23.88,
      "end": 28.44,
      "text": "So a friend of mine who's a spiritual teacher has a really good take, his name is Jeff Foster.",
      "duration": 4.56
    },
    {
      "start": 28.78,
      "end": 37.0,
      "text": "His take on it is that they should change, you know, you should think of the word as depressed as deep rest.",
      "duration": 8.22
    },
    {
      "start": 38.02,
      "end": 44.92,
      "text": "Deep rest, your body needs to be depressed. It needs deep rest from the character that you've been trying to play.",
      "duration": 6.9
    }
  ]
}